---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalCriticalpathParam
source: html/de3a737d-7a19-9b21-7b40-b21b05548421.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalCriticalpathParam Property

"Critical Path"

## Syntax (C#)
```csharp
public static ForgeTypeId MepAnalyticalCriticalpathParam { get; }
```